'''Установка интерпретатора python3

Мы рекомендуем установить последнюю на текущий момент версию языка python3 - версию python 3.5

Чтобы загрузить установщики для операционных систем Windows и Mac OS, достаточно перейти 
по ссылке https://www.python.org/downloads/release/python-351/ ﻿и в самом низу страницы ﻿выбрать 
﻿нужный для вашей архитектуры установщик интерпретатора: для windows 64bit - "﻿Windows x86-64 executable installer", 
для windows 32bit - "Windows x86 executable installer﻿", для Mac OS ﻿64 bit ﻿- ﻿"Mac OS X 64-bit/32-bit installer", ﻿
для Mac OS 32bit/PPC - ﻿﻿"Mac OS X 32-bit i386/PPC installer".

Для того, чтобы установить python3 на операционных системах linux, необходимо ﻿использовать стандартные ﻿менеджеры 
пакетов﻿ ﻿(apt-get или yum) вашей операционной системы. Например, чтобы установить python3 на операционной системе 
ubuntu необходимо запустить в терминале следующую команду:

sudo apt-get install python3
Чтобы убедиться в том, что вы установили интерпретатор, необходимо запустить интерпретатор в терминале с помощью команды.

﻿python3'''

